Repository: 21Ashi/wise_student_app
Catalog: lib/FlutterINTl/l10n/intl_*.arb
Languages: ar

# Title
source: Login
ar: تسجيل

# UniId
source: University Email
ar: بريد الالكتروني الجامعي

source: Password
ar: كلمة السر

source: Forget password?
ar: نسيت كلمة السر؟

# RememberMe
source: Rememebr me
ar: البقاء مسجلاً للدخول

source: Login
ar: دخول

source: Phone Number
ar: رقم الهاتف

source: Verification
ar: تحقق

# UnderVerifaction
source: we just need your registered phone number to send you password reset code
ar: نحتاج فقط إلى رقم هاتفك المسجل لنرسل لك رمز إعادة تعيين كلمة المرور

source: Reset Password
ar: تغيير كلمة السر

# UnderVerification2
source: Enter the verification code we just sent you on your registered phone number
ar: أدخل رمز التحقق الذي أرسلناه إليك للتو على رقم هاتفك المسجل

# EnterCode
source: Enter Code Here
ar: ادخل رمز التحقق

# UnderCode
source: If you did not receive the code?
ar: إذا لم تتلق الرمز؟

# UnderCode2
source: Resend
ar: ارسل

# VerifyButton
source: Verify
ar: تأكيد

# UnderVerifyButton1
source: Having trouble?
ar: لديك مشكله؟

# UnderVerifyButton2
source: Get Help
ar: مساعدة

# UnderResetPassword
source: Your new password should be different from passwords previously used
ar: يجب أن تكون كلمة المرور الجديدة مختلفة عن كلمات المرور المستخدمة سابقاً

source: New Password
ar: كلمة سر جديدة

# Constraint1
source: Contains at least 6 Characters
ar: يجب ان يحتوي على ٦ احرف على الاقل

# Constraint2
source: Contains at least 1 number
ar: يجب ان يحتوي على رقم

# Constraint3
source: Contains at least 1 special character
ar: يجب ان يحتوي على رمز خاص

# ConfirmPassword
source: Confirm Passowrd
ar: تأكيد كلمة السر

# Constraint4
source: Matched password
ar: كلمة المرور مطابقة

# ConfirmButton
source: Confirm
ar: تأكيد

source: Start Using
ar: بدأ الاستخدام

source: News
ar: الأخبار

# UnderNews1
source: World Islamic Sciences & Education
ar: اخر اخبار جامعة

# UnderNews2
source: University Latest News
ar: العلوم الاسلامية العالمية

source: Library
ar: المكتبة

# UnderLibrary1
source: Here You Can Find Every Book
ar: هنا تجد كل كتاب

# UnderLibrary2
source: You Are Looking For
ar: تبحث عنه

source: Chat
ar: دردشة

# UnderChat1
source: Quick And Simple Way To
ar: طريقة سريعة وبسيطة

# UnderChat2
source: Send And Recieve Text Messages
ar: لإرسال واستقبال الرسائل النصية

source: Test Bank
ar: بنك الاسئلة

# UnderTestBank1
source: We Also Have The Best Test Bank
ar: لدينا أيضًا أفضل بنك اسئلة

# UnderTestBank2
source: For All Your Subjects
ar: لجميع مواضيعك

source: Support
ar: مساعدة

# UnderSupport1
source: Get Reliable Support
ar: احصل على دعم موثوق

# UnderSupport2
source: With Our Application
ar: مع تطبيقنا

source: Latest News
ar: اخر الأخبار

source: See more
ar: شاهد المزيد

# SpecifiedNews
source: The Omani Embassy meets its students at the Wise University
ar: السفارة العمانية تلتقي طلابها في جامعة العلوم الاسلامية

# SpecifiedNewsDate
source: 20.NOV.2023
ar: ٢٠ نوفمبر ٢٠٢٣

# SpecifiedNewsAdmin
source: By Wise Admin
ar: بواسطة المشرف

# BookMark
source: You Have Added This Post To BookMark
ar: لقد أضفت هذا المنشور إلى الإشارة المرجعية

# BookMark2
source: Post Already Saved
ar: تم حفظ المشاركة بالفعل

# Share
source: Copy the link or share it from below.
ar: انسخ الرابط أو شاركه من الأسفل

source: Author
ar: الكاتب

# PostDetails
source: In a meeting filled with love and friendliness, His Excellency Professor Dr. Jaafar Mahmoud Al-Fanatsa, President of the University, met with His Excellency First Secretary Salem bin Sulaiman Al-Wahaibi, Charge d’Affairs of the Cultural Department at the Embassy of the Sultanate of Oman. On the sidelines of the visit, which was attended by the head of the academic department at the embassy, Dr. Abdullah Obaidat, and a number of faculty and administrative staff members at the university, they met with our students at the university from the sisterly Sultanate of Oman and listened to their observations. At the conclusion of the visit, the two parties exchanged shields of appreciation.
ar: في لقاء ملؤه المحبة والود التقى سعادة الأستاذ الدكتور جعفر محمود الفناتسا رئيس الجامعة مع سعادة السكرتير الأول سالم بن سليمان الوهيبي القائم بأعمال الدائرة الثقافية في سفارة المملكة. سلطنة عمان. وعلى هامش الزيارة التي حضرها رئيس القسم الأكاديمي في السفارة الدكتور عبد الله عبيدات وعدد من أعضاء الهيئة التدريسية والإدارية في الجامعة التقوا بطلبتنا في الجامعة من الجامعة الشقيقة سلطنة عمان واستمعت إلى ملاحظاتهم. وفي ختام الزيارة تبادل الطرفان الدروع التقديرية.

source: Fname
ar: اسم الاول

source: Lname
ar: اسم العائلة

# email
source: User Email here
ar: بريد الالكتروني

source: Saved Posts
ar: المشاركات المحفوظة

source: Draft Posts
ar: مسودة المشاركات

source: Settings
ar: الإعدادات

# UnderSavedPosts
source: Only you can see the posts you have saved
ar: يمكنك أنت وحدك رؤية المشاركات التي قمت بحفظها

# PostDeleted
source: Post Detleted
ar: تم حذف المشاركة

source: Undo
ar: الغاء

# UnderDraftPosts
source: Only you can see this
ar: أنت فقط تستطيع رؤية هذا

# NavHome
source: Home
ar: الرئيسية

# NavLibrary
source: Library
ar: المكتبة

# NavNotifications
source: Notifications
ar: الإشعارات

# NavChat
source: Chat
ar: الدردشة

# UnderNotifications
source: Receive notifications of new things to suit your interests.
ar: تلقي إشعارات بالأشياء الجديدة التي تناسب اهتماماتك.

source: Dark Theme
ar: داكن

# UnderDarkTheme
source: Change the theme to dark mode.
ar: تغيير السمة الى داكن.

source: Languages
ar: اللغات

# UnderLangauages
source: Change the language between Arabic or English.
ar: تغيير اللغة بين العربي والانجليزي

source: Change Password
ar: تغيير كلمة السر

source: Change
ar: تغيير

# ChangeText
source: Change your password?
ar: هل تريد تغيير كلمة المرور الخاصة بك؟

source: Close
ar: أغلق

source: Logout
ar: تسجيل خروج

# LogoutText
source: Log out of your account?
ar: هل تريد الخروج من حسابك؟

# LogoutButton
source: Logout
ar: خروج

# Enlgish
source: English
ar: الانجليزية

source: Arabic
ar: العربية

source: New Post
ar: منشور جديد

# NewPostTitle
source: Title
ar: عنوان

# NewPostDescription
source: What's Happening
ar: الوصف

# NewPostTime
source: Time :
ar: الوقت :

# NewPostDate
source: Date :
ar: التاريخ :

# NewPostButton1
source: Everyone who can view this post
ar: كل من يستطيع مشاهدة هذا المنشور

source: Privacy Settings
ar: إعدادات الخصوصية

# UnderPrivSettings
source: Who can view this post
ar: من يمكنه مشاهدة هذه المشاركة

source: Everyone
ar: الجميع

source: Who Can See This :
ar: من يستطيع رؤية هذا :

source: Friends
ar: أصدقاء

source: Only Me
ar: أنا فقط

# SchedulePost
source: Schedule your post for later
ar: جدولة مشاركتك في وقت لاحق

source: Save
ar: حفظ

source: Share to
ar: مشاركة

source: Post it
ar: نشر

source: Search...
ar: بحث...

source: New Collection
ar: مجموعة جديدة

source: Category
ar: فئة

# BookTitle
source: Title
ar: عنوان الكتاب

source: Popular
ar: شائع

source: Art
ar: فن

source: Business
ar: تجارة

source: IT
ar: تكنولوجيا

source: Management
ar: إدارة

source: Design
ar: تصميم

# BookAuthor
source: Author
ar: جولي زيهو

source: Book Details
ar: تفاصيل الكتاب

# BookCategory
source: Category
ar: فئة

# BookPage
source: Page
ar: عدد الصفحات

# BookLanguage
source: Language
ar: اللغة

# BookRelease
source: Release
ar: الإصدار

# Bookinfo
source: This book is intended for a one-semester, beginner’s level course on Java programming. It includes the new features included in JDK1.7. Each of its 16 chapters provide review questions for the readers to self-test their learning. “Try It Out” programs that enable the readers to develop programs for real life problems have also been included. Introduction to Java Programming will help budding programmers solidify their foundation on Java and move on to higher level topics like Swing, JDBC, Servlets etc. Key Features• Simple presentation with an in-depth explanation of concepts up to the required level• Complete programs provided for each concept• New features included in JDK1.7• Updated to J2SE7• Uses the recently introduced printf() method defined in Console class instead of the classical statement System.out.println().
ar: هذا الكتاب مخصص لدورة دراسية لمستوى المبتدئين مدتها فصل دراسي واحد حول برمجة Java. ويتضمن الميزات الجديدة المضمنة في JDK1.7. يقدم كل فصل من فصوله الستة عشر أسئلة مراجعة للقراء لاختبار تعلمهم ذاتيًا. كما تم تضمين البرامج التي تمكن القراء من تطوير برامج لمشاكل الحياة الحقيقية. ستساعد المقدمة إلى برمجة Java المبرمجين الناشئين على ترسيخ أسسهم على Java والانتقال إلى مواضيع ذات مستوى أعلى مثل Swing وJDBC وServlets وما إلى ذلك. الميزات الرئيسية عرض تقديمي بسيط مع شرح متعمق للمفاهيم حتى المستوى المطلوب توفير برامج كاملة لكل مفهوم • الميزات الجديدة المضمنة في JDK1.7 • تم التحديث إلى J2SE7 • يستخدم طريقة printf() التي تم تقديمها مؤخرًا والمحددة في فئة وحدة التحكم بدلاً من العبارة الكلاسيكية System.out.println().

source: Borrow
ar: إعارة

source: Add Book
ar: إضافة كتاب

source: Type here
ar: اكتب هنا

source: Cancel
ar: إلغاء

source: Shopping Cart
ar: سلة التسوق

# BorrowTime
source: Borrowed for 5 days only
ar: إعارة لمدة ٥ ايام

# NotificationTitle
source: Notifications
ar: الاشعارات

source: Today
ar: اليوم

source: Yesterday
ar: البارحة

# LastWeek
source: Last 7 days
ar: آخر 7 ايام

# LastMonth
source: Last 30 days
ar: آخر 30 يوم

# Sender
source: Amal James
ar: امل جيمس

# Message
source: has texted you
ar: ارسل اليك رسالة

# Time
source: 2h
ar: 2 س

source: Sender Name
ar: اسم المرسل

source: timestamp
ar: الوقت

source: message text
ar: نص الرسالة

# GoodMornaing
source: Good Morning
ar: صباح الخير

# UserName
source: Abdelmajeed Ashi
ar: عبدالمجيد عشي

# DateDay
source: Today 4:07PM
ar: اليوم 4:07 م

# LastSeen
source: Active 10m ago
ar: نشط قبل 10د

source: calling
ar: يتصل

source: Chat Deleted
ar: تم حذف المحادثة

source: Undo
ar: الرجوع

source: Create Group
ar: انشاء مجموعة

# ChooseMember
source: Choose members for create a group
ar: اختر الاعضاء لأنشاء المجموعة

# MembersNumber
source: Members 9
ar: عدد الاعضاء 9

# NewGroup
source: Create New Group
ar: انشاء مجموعة جديدة
